GT2/GT2/SRS/LES-WALE_LRN/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{
    LESModel        WALE;
    //LESModel        Smagorinsky;
    //LESModel        DeardorffDiffStress;
    //LESModel        kEqn;
    //LESModel	      dynamicKEqn;

    turbulence		on;
    printCoeffs		on;

//WALE coefficients
/*
    WALECoeffs
    {
        Ck                  0.094;
        Ce                  1.048;
        //Cw                  0.325;
        Cw                  0.6;
    }
*/

/*
    SmagorinskyCoeffs
    {
        //Ck                  0.094;
        //Ce                  1.048;

        Ck                  0.05;
        Ce                  1.0;
    }
*/

    delta           cubeRootVol;

    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    dynamicKEqnCoeffs
    {
        filter simple;

	//Ce         	1.048;
	//widthCoeff 	2;	//laplace - anisotropic
    }

}

// ************************************************************************* //
